
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИзмененияВКонфигурации
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияВКонфигурации");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Изменения; 
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("База","База");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектМетаданных","ОбъектМетаданных");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектКонфигурации","ОбъектКонфигурации");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЭлементыОбъектаКонфигурации","ЭлементыОбъектаКонфигурации");
	Блокировка.Заблокировать();
	
	//РегистрыСведений.ИзмененияВКонфигурации.Записывать = Истина;
	НаборЗаписей = РегистрыСведений.ИзмененияВКонфигурации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументИзменений.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого ТекСтрокаИзменения Из Изменения Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.Период = Дата;
		Движение.База = ТекСтрокаИзменения.База;
		Движение.ОбъектМетаданных = ТекСтрокаИзменения.ОбъектМетаданных;
		Движение.ОбъектКонфигурации = ТекСтрокаИзменения.ОбъектКонфигурации;
		Движение.ЭлементыОбъектаКонфигурации = ТекСтрокаИзменения.ЭлементыОбъектаКонфигурации;
		Движение.ДокументИзменений = Ссылка;
		Движение.ОписаниеИзменений = ТекСтрокаИзменения.ОписаниеИзменений;
		Движение.Изменено = ТекСтрокаИзменения.Изменено;
		Движение.Добавлено = ТекСтрокаИзменения.Добавлено;
		Движение.ДатаИзменений = ТекСтрокаИзменения.ДатаИзменений;
		Движение.ИзмененияВСтруктуреЭлемента = ТекСтрокаИзменения.ИзмененияВСтруктуреЭлемента;
		Движение.Задача = ТекСтрокаИзменения.Задача;
		Движение.Инициатор = ТекСтрокаИзменения.Инициатор;
		Движение.Исполнитель = ТекСтрокаИзменения.Исполнитель;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задачи") 
		или (ТипЗнч(ДанныеЗаполнения) = Тип("Массив") 
			и ДанныеЗаполнения.Количество() > 0 
			И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.Задачи")) Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

		Запрос.Текст = "ВЫБРАТЬ
		               |	&ТекущаяДата КАК ДатаИзменений,
		               |	ЗадачиОбъектыЗадачи.База КАК База,
		               |	ЗадачиОбъектыЗадачи.Ссылка КАК Задача,
		               |	ЗадачиОбъектыЗадачи.Ссылка.Инициатор КАК Инициатор,
		               |	ЗадачиОбъектыЗадачи.Исполнитель КАК Исполнитель,
		               |	ЗадачиОбъектыЗадачи.Добавление КАК Добавлено,
		               |	ЗадачиОбъектыЗадачи.Изменение КАК Изменено,
		               |	ЗадачиОбъектыЗадачи.ИзмененияВСтруктуреЭлемента КАК ИзмененияВСтруктуреЭлемента,
		               |	ЗадачиОбъектыЗадачи.ОбъектМетаданных КАК ОбъектМетаданных,
		               |	ЗадачиОбъектыЗадачи.ОбъектКонфигурации КАК ОбъектКонфигурации,
		               |	ЗадачиОбъектыЗадачи.ОписаниеИзменений КАК ОписаниеИзменений,
		               |	ЗадачиОбъектыЗадачи.ЭлементыОбъектаКонфигурации КАК ЭлементыОбъектаКонфигурации
		               |ИЗ
		               |	Документ.Задачи.ОбъектыЗадачи КАК ЗадачиОбъектыЗадачи
		               |ГДЕ
		               |	ЗадачиОбъектыЗадачи.Ссылка "+?(ТипЗнч(ДанныеЗаполнения) = Тип("Массив"), " В ", " = ")+" &ДанныеЗаполнения";
		Выборка = Запрос.Выполнить().Выбрать();
		
		База = "";
		// Заполнение шапки
		Пока Выборка.Следующий() Цикл
			База = Выборка.База;
			НоваяСтрока = Изменения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		Комментарий = "" 
					+ База 
					+ ?(ПустаяСтрока(База), "", ":") 
					+ ДанныеЗаполнения.ОписаниеЗадачи 
					+ ?(не ПустаяСтрока(ДанныеЗаполнения.ОписаниеЗадачи) 
						и не ПустаяСтрока(ДанныеЗаполнения.Комментарий), "; ","")
					+ ДанныеЗаполнения.Комментарий;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
